
import React from "react";
import { Container, Row, Col } from "react-bootstrap";
import { LiaBookSolid } from "react-icons/lia";
import zavicajno from '../../images/zavicajno.jpg'
import AnimatedImage from "./AnimatedImage";
const Homlend =()=>{
return (<>
 <Container  className="container-library mt-4 mb-4">
 <div className="container-frame">

 <Row>          <h1 className="container-title" >ЗАВИЧАЈНА ЗБИРКА</h1> 
  <div className="container-icon">
               <LiaBookSolid /><LiaBookSolid/><LiaBookSolid/></div><hr/>
   
        <Col md={12} >
          <p className="container-text">
          Градска библиотека „Атанасије Стојковић“ у Руми
интензивно ради на сакупљању грађе за Завичајни
фонд након што је донесен војвођански закон о
библиотекама 1974. године. Данас Завичајна
збирка обухвата преко 3.000 библиотечких
јединица, које су обрађене по свим библиотечким
стандардима. </p></Col>
        
    <Col md={12} className="text-center">
            <AnimatedImage src={zavicajno} alt="Физика Атанасија Стојковића" className='container-image'/></Col>
 
 
      <Col md={12}>
          <br/>
          <p className="container-text"> Монографских публикација има
2.285, периодике 125, док остатак представља
некњижну грађу. Монографске публикације у збирци
су сложене по формату, а некњижна грађа према
УДК. Монографске публикације највећим делом
обухватају белетристику, монографије,
самоуправни акти предузећа и установа, научни
радови у облику сепарата или зборника који су
добијени од аутора на поклон, затим,
библиографски радови, листови и билтени
предузећа и школа из нашег града. Серијске
публикације обухватају новине и часописе, док се
некњижна грађа односи на плакате, разгледнице,
позивнице и остали ситан штампани материјал.
Публикације из фонда Завичајне збирке не износе
се ван Градске библиотеке, већ се користе искључиво у

Читаоници. У већини случајева корисницима се дају
дупликати или фотокопије. Најзначајнија
публикација која се налази у фонду Завичајне
збирке је „Фисика, простим језиком списана за род
славено-сербскиј“ Атанасија Стојковића, штампана
у три тома у Будиму 1801, 1802. и 1803. године. Од
старије периодике издваја се „Застава“ – лист
Српске народне радикалне странке из 1901, 1902,
1903, 1904. и 1906. године. „Застава“ је излазила у
Руми у издању „Рада“ – деоничарског друштва за
издавање српских књига и новина. <hr/>Завичајне збирке
су веома важне, јер обухватају сву историјску и
савремену стварност одређеног географског
подручја. Фонд ове збирке је неоспорно значајан, не
само за кориснике наше библиотеке већ и за
становништво у целини, јер поред информативне и
сазнајне улоге имају и образовну и васпитну улогу
за генерације које долазе. </p>
          
          
         <hr/> </Col> </Row>

        </div>
   
    </Container>

   

</>)
}

export default Homlend