import React from "react";
import { Container, Row, Col } from "react-bootstrap";
import decije from '../../images/decije.jpg'
import { LiaBookSolid } from "react-icons/lia";
import isidora from '../../images/isidora.jpg'
import AnimatedImage from "./AnimatedImage";
const Kid =()=>{
    return (<>
    <Container className="container-library mt-4 mb-4">
         <div className="container-frame"><h2 className="container-title" > ОДЕЉЕЊЕ ЗА ДЕЦУ</h2><div className="container-icon">
                         <LiaBookSolid /><LiaBookSolid/><LiaBookSolid/></div>   <hr/><br/>
      <Row>
        <Col md={12} >
          <p className='container-text'>
          Одељење за децу броји око 18.000 публикација.
Фонд је уређен по УДК систему и унутар група
уазбучен. Богат је бројним двојезичним књигама,
сликовницама, лектирама, моторичким књигама,
звучним књигама и енциклопедијама. Одељење за
децу је организовано у две просторије. Прва
просторија је намењена за публикације које су
изложене за читаоце. Друга просторија је намењена
за радионице у којима учествују наши најмлађи
корисници: бројне вртићке групе, ученици основних
школа, као и неки разреди средњошколаца.
Успешну сарадњу поред државних образовно-
васпитних институција, остварујемо и са Дневним
боравком „Солидарност“, приватним: школицама
језика, чуваоницама деце и са музичким школицама.
Свако одељење за децу, па тако и наше,
представља место на ком се рађају и стварају
будући љубитељи књига. Из тог разлога негујемо
вишегодишњу традицију доделе бесплатних
чланских картица првацима и предшколцима.
          </p>
          
        </Col>
        <Col md={12} className="text-center" >
        <AnimatedImage src={decije} alt="Дечије одељење" className='container-image'/></Col>
          
      </Row>
    
      <Row>       <br/><h1 className="container-title" > <br/>Културни кутак </h1>  <br/><hr/>
        <Col md={6}>
      <br/><p className="container-text">На Одељењу за децу наше библиотеке одржавали
су се бројни литерарни конкурси поводом
Међународног дана детета и поводом Светског
дана дечије књиге. Неки од њих су: „Имам и ја своја
права“ и „Моја модерна бајка“.<br/> Библиотека сваке
године обележава и Светски дан поезије, уз
музичке тачке и дечије рецитације.
<br/><hr/>И дан Светог Саве је посебан дан за нашу установу
као и за друге културно-образовне институције.

Путем занимљивих прича о Растку Немањићу деца
уче о томе ко је он био, и колико је заслужан за
развој српског школства.
<br/><hr/>
Простори наше библиотеке су увек радо отворени,
па смо већ две године заредом, са посебним
задовољством, угостили учеснике општинске
смотре рецитатора: „Песниче народа мог“.
Као домаћини овог значајног такмичења, које
традиционално организује Основна школа „Душан
Јерковић“, пружили смо подршку младим талентима
у њиховом креативном изражавању. </p>
        
       </Col>
        <Col md={6} className="mt-5">
        <AnimatedImage src={isidora} alt="Радионица: Исидора Мун" className='container-image'/>
           <br/><div className="container-icon">
           <LiaBookSolid /><LiaBookSolid/><LiaBookSolid/></div> 
        </Col>
        <Col md={12}>
            <p className="container-text" >Водећи се
јасном мисијом, библиотекари наше установе често
организују радионице за децу, које укључују
читање, креативне активности и учење кроз игру. </p></Col>
      </Row> 
    </div>    </Container>
    </>)
}
export default Kid